Repository: f-droid/fdroidserver
Catalog: locale/ba/LC_MESSAGES/fdroidserver.po
Languages: ba

source: JAR signature failed to verify: {path}
ba: JAR имзаһы тикшерелмәне: {path}

source: JAR signature verified: {path}
ba: JAR имзаһы тикшерелде: {path}

source: Java JAR file
ba: Java JAR файлы

source: Java JDK not found! Install in standard location or set java_paths!
ba: Java JDK табылманы! Стандарт урынға ҡуйығыҙ йәки java_paths-ты күрһәтегеҙ!

source: Java compiled class
ba: Компиляцияланған Java класы

source: Java jarsigner not found! Install in standard location or set java_paths!
ba: Java jarsigner табылманы! Стандарт урынға ҡуйығыҙ йәки java_paths-ты күрһәтегеҙ!

source: Javascript in HTML src attributes
ba: HTML-дың src атрибуттарында Javascript

source: Keeping failed build "{apkfilename}"
ba: Уңышһыҙ йыйылған "{apkfilename}" һаҡлана

source: Keystore for signing key:
ba: Имзалау асҡысы өсөн асҡыстар һаҡлағысы:

source: Known debug key is used in AllowedAPKSigningKeys:
ba: AllowedAPKSigningKeys-та билдәле төҙәтеү асҡысы ҡулланыла:

source: Last used commit '{commit}' looks like a tag, but UpdateCheckMode is '{ucm}'
ba: Һуңғы ҡулланылған '{commit}' коммиты тегҡа оҡшаған, ләкин UpdateCheckMode '{ucm}' итеп ҡуйылған

source: Liberapay donation methods belong in the Liberapay: field
ba: Liberapay иғәнә ысулдары Liberapay: яланында булырға тейеш

source: List files that would be reformatted (dry run)
ba: Яңынан форматланасаҡ файлдарҙың исемлеге (ҡоро эшләтеп ҡарау)

source: Locale included in f-droid.org URL
ba: f-droid.org URL-ында локаль бар

source: Make the build stop on exceptions
ba: Хаталар булғанда йыйыуҙы туҡтатыу

source: Malformed repository mirrors.
ba: Репозиторий көҙгөләре дөрөҫ форматланмаған.

source: Malformed serverwebroot line:
ba: serverwebroot юлы дөрөҫ форматланмаған:

source: Max recursion depth in ZIP file reached: %s
ba: ZIP файлында максималь рекурсия тәрәнлегенә етелде: %s

source: Mirror config for {url} contains "isPrimary" key!
ba: {url} өсөн көҙгө көйләүҙәрендә "isPrimary" асҡысы бар!

source: Mirror the full repo and archive, all file types.
ba: Репо менән архивтың тулы көҙгөһөн яһау, бөтә файл төрҙәре.

source: Missing output directory
ba: Сығарыу каталогы юҡ

source: Moving Anti-Features declarations to localized files:
ba: Anti-Features декларацияларын локалләштерелгән файлдарға күсереү:

source: Neither "repo_pubkey" nor "keystorepass" set in config.yml
ba: config.yml-да "repo_pubkey" ҙә, "keystorepass" та күрһәтелмәгән

source: No APK for package: %s
ba: %s пакеты өсөн APK юҡ

source: No Android SDK found!
ba: Android SDK табылманы!

source: No attached devices found
ba: Тоташтырылған ҡоролмалар табылманы

source: No devices found for `adb install`! Please plug one in.
ba: `adb install` өсөн ҡоролмалар табылманы! Зинһар, берәйһен тоташтырығыҙ.

source: No fingerprint in URL.
ba: URL-да бармаҡ эҙе юҡ.

source: No git submodules available
ba: git аҫмодулдәре юҡ

source: No gradle project could be found. Specify --subdir?
ba: gradle проекты табылманы. --subdir күрһәтеп ҡарайһығыҙмы?

source: No information found.
ba: Мәғлүмәт табылманы.

source: No matching tags found
ba: Ярашлы тегтар табылманы

source: No minimum SDK version found in {0}, using default (3).
ba: {0} эсендә SDK-ның минималь версияһы табылманы, стандарт (3) ҡулланыла.

source: No need to specify that the app is Free Software
ba: Ҡушымтаның Ирекле Программа булыуын күрһәтеү кәрәкмәй

source: No need to specify that the app is for Android
ba: Ҡушымтаның Android өсөн булыуын күрһәтеү кәрәкмәй

source: No option set! Edit your config.yml to set at least one of these:
ba: Бер параметр ҙа күрһәтелмәгән! config.yml файлына үҙгәреш индереп, ошоларҙың кәмендә береһен күрһәтегеҙ:

source: No packages specified
ba: Пакеттар күрһәтелмәгән

source: No signed APK available for %s
ba: %s өсөн тамғаланған APK юҡ

source: No signed output directory - nothing to do
ba: Тамғаланған сығарыу каталогы юҡ — эшләр нәмә юҡ

source: No signing certificates found in {path}
ba: {path} эсендә имзалау сертификаттары табылманы

source: No such package: %s
ba: Бындай пакет юҡ: %s

source: No such versionCode {versionCode} for app {appid}
ba: {appid} ҡушымтаһы өсөн бындай {versionCode} versionCode-ы юҡ

source: No tags found
ba: Тегтар табылманы

source: No unsigned directory - nothing to do
ba: Тамғаланмаған каталог юҡ — эшләр нәмә юҡ

source: No version information could be found.
ba: Версия тураһында мәғлүмәт табылманы.

source: Not a valid size definition: "{}"
ba: Дөрөҫ булмаған үлсәм билдәләмәһе: "{}"

source: Nothing to do
ba: Эшләр нәмә юҡ

source: Nothing to do for {appid}.
ba: {appid} өсөн эшләр нәмә юҡ.

source: Now set these in config.yml:
ba: Хәҙер ошоларҙы config.yml-да күрһәтегеҙ:

source: OBB file has newer versionCode({integer}) than any APK:
ba: OBB файлының versionCode-ы ({integer}) теләһә ҡайһы APK-ныҡынан яңыраҡ:

source: OBB filename must start with "main." or "patch.":
ba: OBB файлының исеме "main." йәки "patch." менән башланырға тейеш:

source: OBB's packagename does not match a supported APK:
ba: OBB-ның пакет исеме яраҡлы APK-ға тап килмәй:

source: Offline machine, skipping git mirror generation until `fdroid deploy`
ba: Офлайн машина, `fdroid deploy` эшләтелгәнгә тиклем git көҙгөһөн булдырыу үткәреп ебәрелә

source: One of the 'github_releases' config items is missing the 'packageNames' value. skipping ...
ba: 'github_releases' көйләүҙәренең береһендә 'packageNames' ҡиммәте юҡ. үткәреп ебәрелә ...

source: One of the 'github_releases' config items is missing the 'projectUrl' value. skipping ...
ba: 'github_releases' көйләүҙәренең береһендә 'projectUrl' ҡиммәте юҡ. үткәреп ебәрелә ...

source: One of the 'github_releases' config items is missing the 'token' value. skipping ...
ba: 'github_releases' көйләүҙәренең береһендә 'token' ҡиммәте юҡ. үткәреп ебәрелә ...

source: Only PNG and JPEG are supported for graphics, found: {path}
ba: Графика өсөн тик PNG һәм JPEG ғына ярай, табылды: {path}

source: Only accepts a single key "env"
ba: Тик бер генә "env" асҡысын ҡабул итә

source: Only process apps with auto-updates
ba: Тик автоматик яңыртылыусы ҡушымталарҙы ғына эшкәртеү

source: OpenCollective donation methods belong in the OpenCollective: field
ba: OpenCollective иғәнә ысулдары OpenCollective: яланында булырға тейеш

source: Output JSON report to file named after APK.
ba: JSON отчетын APK исеме менән аталған файлға сығарыу.

source: Output JSON to stdout.
ba: JSON-ды стандарт сығарыу ағымына (stdout) сығарыу.

source: Outputting JSON
ba: JSON сығарыла

source: Overall license of the project.
ba: Проекттың дөйөм лицензияһы.

source: Overriding blank versionName in {apkfilename} from metadata: {version}
ba: {apkfilename} эсендәге буш versionName мета-мәғлүмәттән алынған {version} менән алмаштырыла

source: Package "{appid}" already exists
ba: "{appid}" пакеты инде бар

source: Parsing manifest at '{path}'
ba: '{path}' юлындағы манифест таныла

source: Password required with username
ba: Ҡулланыусы исеме менән бергә пароль кәрәк

source: Path to main Android project subdirectory, if not in root.
ba: Төп Android проектының аҫкаталогына юл, әгәр ул тамыр каталогында булмаһа.

source: Path to the Android SDK (sometimes set in ANDROID_HOME)
ba: Android SDK-ға юл (ҡайһы саҡ ANDROID_HOME-да күрһәтелә)

source: Path to the git repo to use as the log
ba: Лог итеп ҡулланыу өсөн git репозиторийына юл

source: Path to the keystore for the repo signing key
ba: Репо имзалау асҡысы өсөн асҡыстар һаҡлағысына юл

source: Print the secret variable to the terminal for easy copy/paste
ba: Йәшерен үҙгәреүсәнде күсереп-ҡуйыу еңел булһын өсөн терминалға сығарыу

source: Privacy mode was enabled based on your locale ({country_code}).
ba: Һеҙҙең локаль ({country_code}) нигеҙендә хосусилыҡ режимы ҡабыҙылды.

source: Problem with ZIP file: %s, error %s
ba: ZIP файлы менән проблема: %s, хата %s

source: Problem with xml at '{path}'
ba: '{path}' юлындағы xml менән проблема

source: Process auto-updates
ba: Автоматик яңыртыуҙарҙы эшкәртеү

source: Processing {apkfilename}
ba: {apkfilename} эшкәртелә

source: Processing {appid}
ba: {appid} эшкәртелә

source: Produce human-readable XML/JSON for index files
ba: Индекс файлдары өсөн кеше уҡый алырлыҡ XML/JSON булдырыу

source: Project URL to import from.
ba: Импортлау өсөн проекттың URL-ы.

source: Punctuation should be avoided
ba: Тыныш билдәләренән ҡасырға кәрәк

source: Push the log to this git remote repository
ba: Логты ошо алыҫтағы git репозиторийына ебәреү

source: Pushing binary transparency log to {url}
ba: Бинар асыҡлыҡ логы {url} адресына ебәрелә

source: Pushing to remote server failed!
ba: Алыҫтағы серверға ебәреү уңышһыҙ булды!

source: Pushing to {url}
ba: {url} адресына ебәрелә

source: Quickly start a new repository
ba: Яңы репозиторийҙы тиҙ генә башлау

source: Read all the metadata files and exit
ba: Барлыҡ мета-мәғлүмәт файлдарын уҡыу һәм сығыу

source: Reading '{config_file}'
ba: '{config_file}' уҡыла

source: Reading packageName/versionCode/versionName failed, APK invalid: '{apkfilename}'
ba: packageName/versionCode/versionName уҡылманы, APK дөрөҫ түгел: '{apkfilename}'

source: Reading packageName/versionCode/versionName failed,APK invalid: '{apkfilename}'
ba: packageName/versionCode/versionName уҡылманы, APK дөрөҫ түгел: '{apkfilename}'

source: Reading {apkfilename} from cache
ba: {apkfilename} кештан уҡыла

source: Refresh and cache scanner rules and signatures from the network
ba: Сканлаусы ҡағиҙәләрен һәм имзаларын селтәрҙән яңыртыу һәм кешлау

source: Refusing to sign '{path}', file exists in both {dir1} and {dir2} folder.
ba: '{path}' тамғалауҙан баш тартам, файл {dir1} һәм {dir2} каталогтарында ла бар.

source: Remove source tarball and any APKs if successfully verified.
ba: Уңышлы тикшерелһә, сығанаҡ tarball-ды һәм теләһә ниндәй APK-ларҙы юйыу.

source: Removing specified files
ba: Күрһәтелгән файлдар юйыла

source: Removing {path}"
ba: "{path} юйыла

source: Rename APK files that do not match package.name_123.apk
ba: package.name_123.apk ҡалыбына тап килмәгән APK файлдарының исемен үҙгәртеү

source: Resigning {apkfilename} with provided debug.keystore
ba: {apkfilename} бирелгән debug.keystore менән яңынан тамғалана

source: Resize all the icons exceeding the max pixel size and exit
ba: Максималь пиксель үлсәменән артҡан бөтә иконкаларҙың үлсәмен үҙгәртеү һәм сығыу

source: Restrict output to warnings and errors
ba: Сығарылышты иҫкәрмәләр һәм хаталар менән сикләү

source: Retrying failed download: %s
ba: Уңышһыҙ йөкмәү ҡабатлана: %s

source: Rewrite all the metadata files
ba: Барлыҡ мета-мәғлүмәт файлдарын үҙгәртеп яҙыу

source: Rewriting '{appid}'
ba: '{appid}' үҙгәртеп яҙыла

source: Run on git repo that has uncommitted changes
ba: Һаҡланмаған үҙгәрештәре булған git репозиторийында эшләтеү

source: Run over {cibase} to find -debug.apk. and skip repo_basedir {repo_basedir}
ba: {cibase} буйлап -debug.apk. табыу өсөн эшләтеү. һәм repo_basedir {repo_basedir} үткәреп ебәреү

source: Run rewritemeta to fix formatting
ba: Форматлауҙы төҙәтеү өсөн rewritemeta-ны эшләтегеҙ

source: Running first pass with MD5 checking disabled
ba: MD5 тикшереүе һүндерелгән килеш беренсе үтеү башҡарыла

source: Running wget in {path}
ba: wget {path} каталогында эшләтелә

source: SHA-256 of {url} does not match entry!
ba: {url} адресының SHA-256 суммаһы яҙмаға тап килмәй!

source: Scan the resulting APK(s) for known non-free classes.
ba: Алынған APK(-лар)ҙы билдәле ирекле булмаған кластарға сканлау.

source: Scan the source code of a package
ba: Пакеттың сығанаҡ кодын сканлау

source: Scanner found {count} problems in {apk}
ba: Сканлаусы {apk} эсендә {count} проблема тапты

source: Scanner found {count} problems in {appid}:
ba: Сканлаусы {appid} эсендә {count} проблема тапты:

source: Scanner found {count} problems in {appid}:{versionCode}:
ba: Сканлаусы {appid}:{versionCode} эсендә {count} проблема тапты:

source: Scanner found {} problem
ba: Сканлаусы {} проблема тапты

source: Scanning APK for extra signing blocks.
ba: APK-ны өҫтәмә имзалау блоктарына сканлау.

source: Scanning APK with dexdump for known non-free classes.
ba: APK-ны dexdump менән билдәле ирекле булмаған кластарға сканлау.

source: Set NDK {release} ({version}) up
ba: NDK {release} ({version}) көйләнде

source: Set clock to that time using:
ba: Сәғәтте ошо ваҡытҡа ҡуйыу өсөн ҡулланығыҙ:

source: Set maximum releases in repo before older ones are archived
ba: Иҫкерәктәре архивланыр алдынан репозиторийҙағы максималь релиздар һанын билдәләү

source: Set open file limit to {integer}
ba: Асыҡ файлдар сикләүен {integer} итеп ҡуйыу

source: Set up an app build for a nightly build repo
ba: Төнгө йыйыу репозиторийы өсөн ҡушымта йыйыуҙы көйләү

source: Setting open file limit failed:
ba: Асыҡ файлдар сикләүен ҡуйып булманы:

source: Setting {0} sec timeout for this build
ba: Был йыйыу өсөн {0} секундлыҡ тайм-аут ҡуйыла

source: Sign and place packages in the repo
ba: Пакеттарҙы тамғалау һәм репозиторийға урынлаштырыу

source: Sign indexes created using update --nosign
ba: update --nosign ярҙамында булдырылған индекстарҙы тамғалау

source: Skip scanning the source code for binaries and other problems
ba: Сығанаҡ кодты бинарҙарға һәм башҡа проблемаларға сканлауҙы үткәреп ебәреү

source: Skipping '{apkfilename}' with invalid signature!
ba: Дөрөҫ булмаған имзалы '{apkfilename}' үткәреп ебәрелә!

source: Skipping GitLab Pages mirror because the repo is too large (>%.2fGB)!
ba: GitLab Pages көҙгөһө үткәреп ебәрелә, сөнки репозиторий бигерәк ҙур (>%.2fGB)!

source: Skipping index generation for {appid}
ba: {appid} өсөн индекс булдырыу үткәреп ебәрелә

source: Skipping {apkfilename} with invalid signature!
ba: Дөрөҫ булмаған имзалы {apkfilename} үткәреп ебәрелә!

source: Skipping {appid}: disabled
ba: {appid} үткәреп ебәрелә: һүндерелгән

source: Specify a local folder to sync the repo to
ba: Репоны синхронлаштырыу өсөн локаль каталогты күрһәтегеҙ

source: Specify an identity file to provide to SSH for rsyncing
ba: rsync өсөн SSH-ға биреләсәк идентификация файлын күрһәтегеҙ

source: Specify which debug keystore file to use.
ba: Ҡайһы төҙәтеү асҡыстар һаҡлағысы файлын ҡулланырға икәнен күрһәтегеҙ.

source: Spew out even more information than normal
ba: Ғәҙәттәгенән дә күберәк мәғлүмәт сығарыу

source: Stripping mystery signature from {apkfilename}
ba: Серле имза {apkfilename} файлынан алына

source: Summary '%s' is just the app's name
ba: '%s' ҡыҫҡаса аңлатмаһы — ул ҡушымтаның исеме генә

source: Summary of length {length} is over the {limit} char limit
ba: {length} оҙонлоғондағы ҡыҫҡаса аңлатма {limit} символ сикләүенән артып китә

source: System clock is older than date in {path}!
ba: Система сәғәте {path} эсендәге датанан иҫкерәк!

source: Tags update mode only works for git, hg, bzr and git-svn repositories currently
ba: Тегтарҙы яңыртыу режимы әлеге ваҡытта тик git, hg, bzr һәм git-svn репозиторийҙары өсөн генә эшләй

source: Tags update mode used in git-svn, but the repo was not set up with tags
ba: Тегтарҙы яңыртыу режимы git-svn-да ҡулланылған, ләкин репо тегтар менән көйләнмәгән

source: Test mode - put output in the tmp directory only, and always build, even if the output already exists.
ba: Һынау режимы — сығарылышты тик tmp каталогына ғына урынлаштырыу һәм сығарылыш булһа ла, һәр ваҡыт йыйыу.

source: The "qrcode" Python package is not installed (e.g. apt-get install python3-qrcode)!
ba: "qrcode" Python пакеты ҡуйылмаған (мәҫ. apt-get install python3-qrcode)!

source: The OBB version code must come after "{name}.":
ba: OBB версия коды "{name}." һуңынан килергә тейеш:

source: The base URL for the repo to log (default: https://f-droid.org)
ba: Лог яһаласаҡ репоның төп URL-ы (стандарт: https://f-droid.org)

source: The directory to write the mirror to
ba: Көҙгөнө яҙыу өсөн каталог

source: The file to be included in the repo (path or glob)
ba: Репоға индереләсәк файл (юл йәки ҡалып)

source: The repository's fingerprint does not match.
ba: Репозиторийҙың бармаҡ эҙе тап килмәй.

source: The root dir for local_copy_dir "{path}" does not exist!
ba: local_copy_dir "{path}" өсөн тамыр каталогы юҡ!

source: There is a keyalias collision - publishing halted
ba: keyalias ҡапма-ҡаршылығы бар — баҫтырыу туҡтатылды

source: These are the apps that have been archived from the main repo.
ba: Былар — төп репозиторийҙан архиваланған ҡушымталар.

source: This command should never be used to mirror f-droid.org! A full copy requires more than 600GB.
ba: Был команда f-droid.org-тың көҙгөһөн яһау өсөн бер ҡасан да ҡулланылырға тейеш түгел! Тулы күсермә өсөн 600GB-тан ашыу урын кәрәк.

source: This is a repository of apps to be used with F-Droid. Applications in this repository are either official binaries built by the original application developers, or are binaries built from source by the admin of f-droid.org using the tools on https://gitlab.com/fdroid.
ba: Был — F-Droid менән ҡулланыу өсөн ҡушымталар репозиторийы. Был репозиторийҙағы ҡушымталар йә оригиналь эшләүселәр тарафынан йыйылған рәсми бинарҙар, йә f-droid.org администраторы тарафынан https://gitlab.com/fdroid адресындағы ҡоралдар ярҙамында сығанаҡ кодтан йыйылған бинарҙар.

source: This repo already has local metadata: %s
ba: Был репоның инде локаль мета-мәғлүмәттәре бар: %s

source: To complete the setup, add your APKs to "%s" then run "fdroid update -c; fdroid update". You might also want to edit "config.yml" to set the URL, repo name, and more. You should also set up a signing key (a temporary one might have been automatically generated). For more info: https://f-droid.org/docs/Setup_an_F-Droid_App_Repo and https://f-droid.org/docs/Signing_Process
ba: Көйләүҙе тамамлау өсөн, APK-ларығыҙҙы "%s" каталогына өҫтәгеҙ, шунан "fdroid update -c; fdroid update" командаһын эшләтегеҙ. Шулай уҡ URL-ды, репо исемен һәм башҡаларҙы көйләү өсөн "config.yml" файлына үҙгәреш индерергә теләрһегеҙ. Шулай уҡ имзалау асҡысын көйләргә тейешһегеҙ (ваҡытлыса асҡыс автоматик рәүештә булдырылған булырға мөмкин). Күберәк мәғлүмәт өсөн: https://f-droid.org/docs/Setup_an_F-Droid_App_Repo һәм https://f-droid.org/docs/Signing_Process

source: To use awsbucket, awssecretkey and awsaccesskeyid must also be set in config.yml!
ba: awsbucket-ты ҡулланыу өсөн config.yml-да awssecretkey һәм awsaccesskeyid та күрһәтелергә тейеш!

source: To use rclone, rclone_config and awsbucket must be set in config.yml!
ba: rclone-ды ҡулланыу өсөн config.yml-да rclone_config һәм awsbucket күрһәтелергә тейеш!

source: URL must start with https:// or http://
ba: URL https:// йәки http:// менән башланырға тейеш

source: URL shorteners should not be used
ba: URL ҡыҫҡартҡыстары ҡулланылырға тейеш түгел

source: URL {url} in Description: {error}
ba: Тасуирламалағы {url} URL-ы: {error}

source: Unexpected license tag "{}"! Only use FSF or OSI approved tags from https://spdx.org/license-list
ba: Көтөлмәгән "{}" лицензия тегы! Тик https://spdx.org/license-list адресынан FSF йәки OSI тарафынан раҫланған тегтарҙы ҡулланығыҙ

source: Unexpected license tag "{}"! Only use license tags configured in your config file
ba: Көтөлмәгән "{}" лицензия тегы! Тик конфигурация файлында көйләнгән лицензия тегтарын ҡулланығыҙ

source: Unknown entry {key} in {configname}
ba: {configname} эсендә билдәһеҙ {key} яҙмаһы

source: Unknown exception found!
ba: Билдәһеҙ хата табылды!

source: Unknown file '{filename}' in build '{versionName}'
ba: '{versionName}' йыйылмаһында билдәһеҙ '{filename}' файлы

source: Unknown metadata format: %s
ba: Билдәһеҙ мета-мәғлүмәт форматы: %s

source: Unknown metadata format: {path} (use: *.yml)
ba: Билдәһеҙ мета-мәғлүмәт форматы: {path} (ҡулланығыҙ: *.yml)

source: Unknown version of aapt, might cause problems:
ba: aapt-тың билдәһеҙ версияһы, проблемалар тыуҙырыуы мөмкин:

source: Unnecessary leading space
ba: Кәрәкмәгән алғы буш урын

source: Unnecessary trailing space
ba: Кәрәкмәгән артҡы буш урын

source: Unrecognised app field '{fieldname}' in '{path}'
ba: '{path}' эсендә танылмаған '{fieldname}' ҡушымта яланы

source: Unrecognised build flag '{build_flag}' in '{path}'
ba: '{path}' эсендә танылмаған '{build_flag}' йыйыу флагы

source: Unsupported file type "{extension}" for repo graphic
ba: Репо графикаһы өсөн яраҡһыҙ "{extension}" файл төрө

source: Unsupported graphics file found: {path}
ba: Яраҡһыҙ графика файлы табылды: {path}

source: Unused extlib at %s
ba: %s юлында ҡулланылмаған extlib

source: Unused file at %s
ba: %s юлында ҡулланылмаған файл

source: Unused scandelete path: %s
ba: Ҡулланылмаған scandelete юлы: %s

source: Unused scanignore path: %s
ba: Ҡулланылмаған scanignore юлы: %s

source: Update repo information for new packages
ba: Яңы пакеттар өсөн репо мәғлүмәтен яңыртыу

source: Update the binary transparency log for a URL
ba: URL өсөн бинар асыҡлыҡ логын яңыртыу

source: UpdateCheckData has invalid URL: {url}
ba: UpdateCheckData-ла дөрөҫ булмаған URL: {url}

source: UpdateCheckData must match the version code as integer (\d or [0-9]): {codeex}
ba: UpdateCheckData версия кодына бөтөн һан булараҡ тап килергә тейеш (\d йәки [0-9]): {codeex}

source: UpdateCheckData must use HTTPS URL: {url}
ba: UpdateCheckData HTTPS URL-ын ҡулланырға тейеш: {url}

source: UpdateCheckData not a valid URL: {url}
ba: UpdateCheckData — дөрөҫ URL түгел: {url}

source: UpdateCheckMode is set but it looks like checkupdates hasn't been run yet.
ba: UpdateCheckMode ҡуйылған, ләкин checkupdates әле эшләтелмәгән кеүек.

source: UpdateCheckName is set to the known application ID, it can be removed
ba: UpdateCheckName билдәле ҡушымта идентификаторына ҡуйылған, уны алып ташларға мөмкин

source: Uploading {apkfilename} to androidobservatory.org
ba: {apkfilename} androidobservatory.org-ҡа йөкләнә

source: Uploading {apkfilename} to virustotal
ba: {apkfilename} virustotal-ға йөкләнә

source: Use /HEAD instead of /master or /main to point at a file in the default branch
ba: Стандарт ботаҡтағы файлға күрһәтеү өсөн /master йәки /main урынына /HEAD ҡулланығыҙ

source: Use `fdroid update -c` to create it.
ba: Уны булдырыу өсөн `fdroid update -c` ҡулланығыҙ.

source: Use build server
ba: Йыйыу серверын ҡулланыу

source: Use date from APK instead of current time for newly added APKs
ba: Яңы өҫтәлгән APK-лар өсөн ағымдағы ваҡыт урынына APK-нан датаны ҡулланыу

source: Using "{path}" for configuring s3cmd.
ba: s3cmd-ты көйләү өсөн "{path}" ҡулланыла.

source: Using "{path}" for syncing with remote storage.
ba: Алыҫтағы һаҡлағыс менән синхронлаштырыу өсөн "{path}" ҡулланыла.

source: Using APK Signature v2
ba: APK имзаһының v2 версияһы ҡулланыла

source: Using APK Signature v3
ba: APK имзаһының v3 версияһы ҡулланыла

source: Using JAR Signature
ba: JAR имзаһы ҡулланыла

source: Using Java's jarsigner, not recommended for verifying APKs! Use apksigner
ba: Java-ның jarsigner-ы ҡулланыла, APK-ларҙы тикшереү өсөн тәҡдим ителмәй! apksigner ҡулланығыҙ

source: Using blank dictionary instead of contents of {path}!
ba: {path} эстәлеге урынына буш һүҙлек ҡулланыла!

source: Using existing keystore "{path}"
ba: Инде булған "{path}" асҡыстар һаҡлағысы ҡулланыла

source: Using rclone to sync with: {url}
ba: Синхронлаштырыу өсөн rclone ҡулланыла: {url}

source: Using s3cmd to sync with: {url}
ba: Синхронлаштырыу өсөн s3cmd ҡулланыла: {url}

source: Valid commands are:
ba: Яраҡлы командалар:

source: Verify against locally cached copy rather than redownloading.
ba: Яңынан йөкмәү урынына локаль кешланған күсермәгә ҡаршы тикшереү.

source: Verify the integrity of downloaded packages
ba: Йөкләнгән пакеттарҙың бөтөнлөгөн тикшереү

source: Verifying index signature:
ba: Индекс имзаһы тикшерелә:

source: Verifying package {path} with apksigner.
ba: {path} пакеты apksigner менән тикшерелә.

source: VirusTotal API key cannot upload files larger than 32MB, use {url} to upload {path}.
ba: VirusTotal API асҡысы 32MB-тан ҙурыраҡ файлдарҙы йөкләй алмай, {path} файлын йөкләү өсөн {url} ҡулланығыҙ.
