Repository: f-droid/fdroidserver
Catalog: locale/ba/LC_MESSAGES/fdroidserver.po
Languages: ba

source: SSH public key to be used as deploy key:
ba: Урынлаштырыу асҡысы итеп ҡулланыу өсөн SSH асыҡ асҡысы:

source: {path} encoded for the DEBUG_KEYSTORE secret variable:
ba: {path} DEBUG_KEYSTORE йәшерен үҙгәреүсәне өсөн кодланған:

source: "%s/" has no matching metadata file!
ba: "%s/" өсөн ярашлы мета-мәғлүмәт файлы юҡ!

source: "isPrimary" key should not be added to mirrors!
ba: "isPrimary" асҡысы көҙгөләргә өҫтәлергә тейеш түгел!

source: "local_copy_dir" {path} does not exist!
ba: "local_copy_dir" {path} каталогы юҡ!

source: "{apkfilename}" is already installed on {dev}.
ba: "{apkfilename}" {dev} ҡоролмаһында инде ҡуйылған.

source: "{path}" contains recent {name} ({version})
ba: "{path}" эсендә {name} ({version}) ҡушымтаһының яңы версияһы бар.

source: "{path}" exists but s3cmd is not installed!
ba: "{path}" бар, ләкин s3cmd ҡуйылмаған!

source: "{path}" is not a supported file format (use: metadata/*.yml)
ba: "{path}" — яраҡлы файл форматы түгел (ҡулланығыҙ: metadata/*.yml)

source: "{path}" is signed by a key that is not allowed:
ba: "{path}" рөхсәт ителмәгән асҡыс менән тамғаланған:

source: "{url}" is not a valid URL!
ba: "{url}" — дөрөҫ URL түгел!

source: %(prog)s: error: %(message)s
ba: %(prog)s: хата: %(message)s

source: %d APKs failed to be signed or verified!
ba: %d APK тамғаланманы йәки тикшерелмәне!

source: %d problems found
ba: %d проблема табылды

source: %r is not callable
ba: %r саҡырылмалы түгел

source: %s did not produce a dict!
ba: %s һүҙлек (dict) ҡайтарманы!

source: %s has bad SHA-256: %s
ba: %s файлының SHA-256 суммаһы дөрөҫ түгел: %s

source: %s is not an accepted build field
ba: %s — рөхсәт ителгән йыйыу яланы түгел

source: 'keypass' not found in config.yml!
ba: config.yml файлында 'keypass' табылманы!

source: 'keystore' is NONE and 'smartcardoptions' is blank!
ba: 'keystore' күрһәтелмәгән һәм 'smartcardoptions' буш!

source: 'keystore' not found in config.yml!
ba: config.yml файлында 'keystore' табылманы!

source: 'keystorepass' not found in config.yml!
ba: config.yml файлында 'keystorepass' табылманы!

source: 'repo_keyalias' not found in config.yml!
ba: config.yml файлында 'repo_keyalias' табылманы!

source: 'required' is an invalid argument for positionals
ba: Позицион аргументтар өсөн 'required' — дөрөҫ булмаған аргумент

source: 'sdk_path' not set in config.yml!
ba: config.yml файлында 'sdk_path' күрһәтелмәгән!

source: '{aapt}' is too old, fdroid requires build-tools-{version} or newer!
ba: '{aapt}' бигерәк иҫке, F-Droid өсөн build-tools-{version} йәки яңыраҡ версияһы кәрәк!

source: '{path}' failed to execute!
ba: '{path}' башҡарылманы!

source: '{path}' has invalid format, it should be a dictionary!
ba: '{path}' форматы дөрөҫ түгел, ул һүҙлек булырға тейеш!

source: '{value}' is not a valid {field} in {appid}. Regex pattern: {pattern}
ba: '{appid}' өсөн '{value}' — дөрөҫ булмаған {field} ҡиммәте. Regex ҡалыбы: {pattern}

source: '{value}' is not a valid {field}, should be {pattern}
ba: '{value}' — яраҡлы {field} түгел, {pattern} булырға тейеш

source: --merge-request only runs on a single appid!
ba: --merge-request тик бер appid менән генә эшләй!

source: ...checkupdate failed for {appid} : {error}
ba: ...{appid} өсөн checkupdate уңышһыҙ үтте: {error}

source: .__call__() not defined
ba: .__call__() билдәләнмәгән

source: /issues is missing
ba: /issues юҡ

source: A URL is required as an argument!
ba: Аргумент итеп URL күрһәтеү мотлаҡ!

source: APK signatures have different certificates in {path}:
ba: {path} эсендәге APK-имзаларҙың сертификаттары төрлө:

source: Add PGP signatures using GnuPG for packages in repo
ba: Репозиторийҙағы пакеттарға GnuPG ярҙамында PGP-имзалар өҫтәү

source: Add a repo signing key to an unsigned repo
ba: Тамғаланмаған репозиторийға репо-имзалау асҡысын өҫтәү

source: Add skeleton metadata files for APKs that are missing them
ba: Мета-мәғлүмәт файлдары булмаған APK-лар өсөн ҡалыптар өҫтәү

source: Adding new repo for only {name}
ba: Тик {name} өсөн генә яңы репозиторий өҫтәү

source: Alias of the repo signing key in the keystore
ba: Асҡыстар һаҡлағысындағы репо-имзалау асҡысының псевдонимы

source: AllowedAPKSigningKeys missing but reference binary supplied
ba: AllowedAPKSigningKeys юҡ, ләкин өлгө бинар файл бирелгән

source: Allows a different revision (or git branch) to be specified for the initial import
ba: Башланғыс импорт өсөн икенсе ревизия (йәки git ботағын) күрһәтергә мөмкинлек бирә

source: Also mirror the full archive section
ba: Шулай уҡ архив бүлегенең тулы күсермәһен яһау

source: Also warn about formatting issues, like rewritemeta -l
ba: Шулай уҡ rewritemeta -l кеүек форматлау проблемалары тураһында иҫкәртеү

source: Android AAR library
ba: Android AAR китапханаһы

source: Android APK file
ba: Android APK файлы

source: Android DEX code
ba: Android DEX коды

source: Android SDK not found at {path}!
ba: Android SDK {path} юлында табылманы!

source: Android SDK path '{path}' does not exist!
ba: '{path}' Android SDK юлы юҡ!

source: Android SDK path '{path}' is not a directory!
ba: '{path}' Android SDK юлы — каталог түгел!

source: Android SDK tool {cmd} not found!
ba: {cmd} Android SDK ҡоралы табылманы!

source: App has Binaries but does not have corresponding AllowedAPKSigningKeys to pin certificate.
ba: Ҡушымтала Binaries бар, ләкин сертификатты беркетеү өсөн тейешле AllowedAPKSigningKeys юҡ.

source: App has NoSourceSince or ArchivePolicy "0 versions" or 0 but AutoUpdateMode or UpdateCheckMode are not None
ba: Ҡушымтала NoSourceSince йәки ArchivePolicy "0 versions" йәки 0 ҡуйылған, ләкин AutoUpdateMode йәки UpdateCheckMode None түгел

source: App is in '{repo}' but has a link to {url}
ba: Ҡушымта '{repo}' эсендә, ләкин {url} адресына һылтанмаһы бар

source: App version has binary but does not have corresponding AllowedAPKSigningKeys to pin certificate.
ba: Ҡушымта версияһында бинар файл бар, ләкин сертификатты беркетеү өсөн тейешле AllowedAPKSigningKeys юҡ.

source: Appending .git is not necessary
ba: .git ҡушып яҙыу мотлаҡ түгел

source: Archiving {apkfilename} with invalid signature!
ba: {apkfilename} дөрөҫ булмаған имза менән архивлана!

source: AutoUpdateMode with UpdateCheckMode: HTTP must have a pattern.
ba: AutoUpdateMode-ла UpdateCheckMode: HTTP өсөн ҡалып булырға тейеш.

source: Automatic no to all prompts.
ba: Барлыҡ һорауҙарға автоматик рәүештә "юҡ" тигән яуап.

source: Automatic yes to all prompts.
ba: Барлыҡ һорауҙарға автоматик рәүештә "эйе" тигән яуап.

source: Bad entry type "{mirrortype}" in mirrors config: {mirror}
ba: Көҙгөләр көйләүҙәрендә дөрөҫ булмаған яҙма төрө "{mirrortype}": {mirror}

source: Base URL to mirror, can include the index signing key using the query string: ?fingerprint=
ba: Көҙгө яһау өсөн төп URL, һорау юлы аша индекс имзалау асҡысын ҡушырға мөмкин: ?fingerprint=

source: Branch '{branch}' used as commit in build '{versionName}'
ba: '{versionName}' йыйылмаһында '{branch}' ботағы коммит булараҡ ҡулланылған

source: Branch '{branch}' used as commit in srclib '{srclib}'
ba: '{srclib}' сығанаҡ китапханаһында '{branch}' ботағы коммит булараҡ ҡулланылған

source: Broken symlink: {path}
ba: Өҙөлгән символик һылтанма: {path}

source: Build a package from source
ba: Пакетты сығанаҡ кодтан йыйыу

source: Build all applications available
ba: Барлыҡ ҡушымталарҙы йыйыу

source: Build generated by `fdroid import` - remove disable line once ready
ba: `fdroid import` менән яһалған йыйылма — әҙер булғас, һүндереү юлын алып ташлағыҙ

source: Build metadata git repo has uncommited changes!
ba: Йыйыу мета-мәғлүмәттәренең git репозиторийында һаҡланмаған үҙгәрештәр бар!

source: Build only the latest version of each package
ba: Һәр пакеттың һуңғы версияһын ғына йыйыу

source: Built repo based in "%s" with this config:
ba: "%s" каталогында ошо көйләүҙәр менән репозиторий төҙөлдө:

source: Can't auto-update app with no CurrentVersionCode
ba: CurrentVersionCode булмаған ҡушымтаны автоматик яңыртып булмай

source: Can't build due to {} error while scanning
ba: Сканлау ваҡытындағы {} хата арҡаһында йыйып булмай

source: Cannot rewrite "{path}"
ba: "{path}" файлын үҙгәртеп яҙып булмай

source: Categories '%s' is not valid
ba: '%s' категориялары дөрөҫ түгел

source: Categories are not set
ba: Категориялар күрһәтелмәгән

source: Category "{category}" defined but not used for any apps!
ba: "{category}" категорияһы билдәләнгән, ләкин бер ҡушымтала ла ҡулланылмай!

source: Check for updates to applications
ba: Ҡушымталар өсөн яңыртыуҙарҙы тикшереү

source: Checking archiving for {appid} - apks:{integer}, keepversions:{keep}, archapks:{arch}
ba: {appid} өсөн архивлауҙы тикшереү - apk:{integer}, һаҡларға:{keep}, архивта:{arch}

source: Clean update - don't uses caches, reprocess all APKs
ba: Таҙа яңыртыу — кештарҙы ҡулланмаҫҡа, бөтә APK-ларҙы яңынан эшкәртергә

source: Color the log output
ba: Лог сығарылышын төҫлө итеү

source: Comma separated list of categories.
ba: Өтөр менән айырылған категориялар исемлеге.

source: Command '%s' not recognised.
ba: '%s' командаһы танылманы.

source: Commit changes
ba: Үҙгәрештәрҙе һаҡлау (commit)

source: Commit changes, push, then make a merge request
ba: Үҙгәрештәрҙе һаҡларға (commit), ебәрергә (push), шунан берләштереүгә һорау яһарға

source: Conflicting "{field}" definitions between .yml and localized files:
ba: .yml һәм локалләштерелгән файлдар араһында "{field}" өсөн ҡапма-ҡаршылыҡлы билдәләмәләр:

source: Conflicting arguments: '--verbose' and '--quiet' can not be specified at the same time.
ba: Ҡапма-ҡаршылыҡлы аргументтар: '--verbose' һәм '--quiet' бер үк ваҡытта күрһәтелә алмай.

source: Could not find '{command}' on your system
ba: Системала '{command}' табылманы

source: Could not find latest version code
ba: Һуңғы версияның кодын табып булманы

source: Could not find latest version name
ba: Һуңғы версияның исемен табып булманы

source: Could not find {path} to remove it
ba: Юйыу өсөн {path} табылманы

source: Could not open APK {path} for analysis:
ba: Анализ өсөн {path} APK файлын асып булманы:

source: Could not parse size "{size}", wrong type "{type}"
ba: "{size}" үлсәмен танып булманы, дөрөҫ булмаған тип "{type}"

source: Couldn't find Application ID
ba: Ҡушымтаның идентификаторын (Application ID) табып булманы

source: Couldn't find any version information
ba: Бер ниндәй ҙә версия мәғлүмәте табылманы

source: Couldn't find package ID
ba: Пакет идентификаторын табып булманы

source: Cowardily refusing to overwrite existing signing key setup!
ba: Инде булған имзалау асҡысы көйләүҙәрен өҫтөнән яҙҙырыуҙан ҡурҡаҡтарса баш тартам!

source: Created new container "{name}"
ba: Яңы "{name}" контейнеры булдырылды

source: Creating "{path}" for configuring s3cmd.
ba: s3cmd-ты көйләү өсөн "{path}" булдырыла.

source: Creating empty {config_file}
ba: Буш {config_file} булдырыла

source: Creating log directory
ba: Логтар каталогы булдырыла

source: Creating new S3 bucket: {url}
ba: Яңы S3 биҙрәһе булдырыла: {url}

source: Creating output directory
ba: Сығарыу каталогы булдырыла

source: Creating signed index with this key (SHA256):
ba: Ошо асҡыс менән тамғаланған индекс булдырыла (SHA256):

source: Creating temporary directory
ba: Ваҡытлыса каталог булдырыла

source: Creating unsigned index in preparation for signing
ba: Тамғалауға әҙерлек өсөн тамғаланмаған индекс булдырыла

source: CurrentVersionCode {cv} is less than oldest build entry {versionCode}
ba: Ағымдағы CurrentVersionCode {cv} иң иҫке йыйылма яҙмаһынан {versionCode} бәләкәйерәк

source: DEBUG_KEYSTORE is not set or the value is incomplete
ba: DEBUG_KEYSTORE күрһәтелмәгән йәки уның ҡиммәте тулы түгел

source: Delete APKs and/or OBBs without metadata from the repo
ba: Репозиторийҙан мета-мәғлүмәттәрһеҙ APK-ларҙы һәм/йәки OBB-ларҙы юйыу

source: Deleting archive, repo is too big ({size} max {limit})
ba: Архив юйыла, репозиторий бигерәк ҙур ({size} макс. {limit})

source: Deleting git-mirror history, repo is too big ({size} max {limit})
ba: git-көҙгөнөң тарихы юйыла, репозиторий бигерәк ҙур ({size} макс. {limit})

source: Deleting unknown file: {path}
ba: Билдәһеҙ файл юйыла: {path}

source: Description '%s' is just the app's summary
ba: '%s' тасуирламаһы — ул ҡушымтаның ҡыҫҡаса аңлатмаһы ғына

source: Description has a duplicate line
ba: Тасуирламала ҡабатланған юл бар

source: Description of length {length} is over the {limit} char limit
ba: {length} оҙонлоғондағы тасуирлама {limit} символ сикләүенән артып китә

source: Did you mean config/{name}.yml?
ba: Һеҙ config/{name}.yml-ды күҙ уңында тоттоғоҙмо?

source: Did you mean {code}?
ba: Һеҙ {code}-ты күҙ уңында тоттоғоҙмо?

source: Do not add 'disable:' to the generated build entries
ba: Булдырылған йыйылма яҙмаларына 'disable:' өҫтәмәгеҙ

source: Do not deploy the new files to the repo
ba: Яңы файлдарҙы репозиторийға урынлаштырмағыҙ

source: Do not include "{path}" in URL!
ba: URL-ға "{path}"-ты индермәгеҙ!

source: Do not prompt for Android SDK path, just fail
ba: Android SDK юлын һорамаҫҡа, шунда уҡ уңышһыҙлыҡ менән тамамларға

source: Do not remove the private keys generated from the keystore
ba: Асҡыстар һаҡлағысынан булдырылған шәхси асҡыстарҙы юймағыҙ

source: Don't create a source tarball, useful when testing a build
ba: Сығанаҡ кодтарҙың tarball-ын яһамаҫҡа, йыйылманы һынағанда файҙалы

source: Don't refresh the repository, useful when testing a build with no internet connection
ba: Репозиторийҙы яңыртмаҫҡа, интернетһыҙ йыйылманы һынағанда файҙалы

source: Don't use rsync checksums
ba: rsync контроль суммаларын ҡулланмаҫҡа

source: Download F-Droid.apk using mirrors that leak less to the network
ba: F-Droid.apk-ны селтәргә аҙыраҡ мәғлүмәт ебәргән көҙгөләр аша йөкмәтергә

source: Download complete mirrors of small repos
ba: Бәләкәй репозиторийҙарҙың тулы көҙгөләрен йөкмәтеү

source: Downloading the repository already failed once, not trying again.
ba: Репозиторийҙы йөкмәтеү бер тапҡыр уңышһыҙ булды инде, яңынан ҡабатланмаясаҡ.

source: Downloading {url} failed. {error}
ba: {url} йөкмәтелмәне. {error}

source: Duplicate Anti-Feature declaration at {path} was ignored!
ba: {path} юлындағы ҡабатланған Anti-Feature декларацияһы иғтибарһыҙ ҡалдырылды!

source: Duplicate entry "%s" in mirrors config!
ba: Көҙгөләр көйләүҙәрендә ҡабатланған "%s" яҙмаһы!

source: Duplicate link in '{field}': {url}
ba: '{field}' яланында ҡабатланған һылтанма: {url}

source: ERROR: %(message)s
ba: ХАТА: %(message)s

source: ERROR: The "server" subcommand has been removed, use "deploy"!
ba: ХАТА: "server" аҫкомандаһы алынды, "deploy" командаһын ҡулланығыҙ!

source: ERROR: unsupported CI type, patches welcome!
ba: ХАТА: яраҡһыҙ CI төрө, төҙәтмәләр хуплана!

source: ERROR: unsupported git host "%s", patches welcome!
ba: ХАТА: яраҡһыҙ git хосты "%s", төҙәтмәләр хуплана!

source: ERROR: {key} in {path} is not "archive" or "repo"!
ba: ХАТА: {path} эсендәге {key} асҡысы "archive" йәки "repo" түгел!

source: ERROR: {key} not a valid key!
ba: ХАТА: {key} — дөрөҫ асҡыс түгел!

source: ERROR: {key}'s value should be of type {t}!
ba: ХАТА: {key} асҡысының ҡиммәте {t} тибында булырға тейеш!

source: ERROR: {key}:{subkey} in {path} is not in allowed keys: {allowed_keys}!
ba: ХАТА: {path} эсендәге {key}:{subkey} рөхсәт ителгән асҡыстар исемлегендә юҡ: {allowed_keys}!

source: Encoding is set to '{enc}' fdroid might run into encoding issues. Please set it to 'UTF-8' for best results.
ba: Кодировка '{enc}' итеп ҡуйылған, F-Droid-та кодировка проблемалары булыуы мөмкин. Иң яҡшы һөҙөмтә өсөн уны 'UTF-8'-гә ҡуйығыҙ.

source: Enter the path to the Android SDK (%s) here: >
ba: Android SDK-ның юлын (%s) бында яҙығыҙ: >

source: Environment variable {var} from {configname} is not set!
ba: {configname} эсенән {var} мөхит үҙгәреүсәне күрһәтелмәгән!

source: Environment variable {{env: {var}}} is not set!
ba: {{env: {var}}} мөхит үҙгәреүсәне күрһәтелмәгән!

source: Error deploying 'github_releases', {} not present. (You might need to run `fdroid update` first.)
ba: 'github_releases' урынлаштырыу хатаһы, {} юҡ. (Башта `fdroid update` командаһын эшләтеп алырға кәрәк булыуы мөмкин.)

source: Error while getting repo address
ba: Репозиторий адресын алғанда хата

source: Exit with a non-zero code if problems were found
ba: Проблемалар табылһа, нулдән айырмалы код менән сығырға

source: Extract application metadata from a source repository
ba: Сығанаҡ репозиторийынан ҡушымтаның мета-мәғлүмәттәрен сығарыу

source: Extract signatures from APKs
ba: APK-ларҙан имзаларҙы сығарыу

source: F-Droid.apk could not be downloaded from any known source!
ba: F-Droid.apk-ны билдәле сығанаҡтарҙың береһенән дә йөкмәтеп булманы!

source: Failed copying {path}: {error}
ba: {path} күсерелмәне: {error}

source: Failed fetching signatures for '{apkfilename}': {error}
ba: '{apkfilename}' өсөн имзаларҙы алып булманы: {error}

source: Failed reading {path}: {error}
ba: {path} уҡылманы: {error}

source: Failed resizing {path}: {error}
ba: {path} үлсәме үҙгәртелмәне: {error}

source: Failed to create S3 bucket: {url}
ba: S3 контейнерын булдырып булманы: {url}

source: Failed to get APK information, deleting {path}
ba: APK тураһында мәғлүмәт алып булманы, {path} юйыла

source: Failed to get APK information, skipping {path}
ba: APK тураһында мәғлүмәт алып булманы, {path} үткәреп ебәрелә

source: Failed to get APK signing key fingerprint
ba: APK имзалау асҡысының бармаҡ эҙен алып булманы

source: Failed to install '{apkfilename}' on {dev}: {error}
ba: '{apkfilename}' {dev} ҡоролмаһына ҡуйылманы: {error}

source: Failed to sign application
ba: Ҡушымтаны тамғалап булманы

source: Fetched buildserverid from VM: {buildserverid}
ba: VM-дан йыйыу-серверының ID-һы алынды: {buildserverid}

source: Fetched signatures for '{apkfilename}' -> '{sigdir}'
ba: '{apkfilename}' өсөн имзалар алынды -> '{sigdir}'

source: File disappeared while processing it: {path}
ba: Файл эшкәртелгән ваҡытта юғалды: {path}

source: Finished
ba: Тамамланды

source: Forbidden HTML tags
ba: Тыйылған HTML тегтары

source: Force build of disabled apps, and carries on regardless of scan problems. Only allowed in test mode.
ba: Һүндерелгән ҡушымталарҙы мәжбүри йыйыу һәм сканлау проблемаларына ҡарамаҫтан дауам итеү. Тик һынау режимында ғына рөхсәт ителә.

source: Force halting build after {0} sec timeout!
ba: {0} секундлыҡ тайм-ауттан һуң йыйыуҙы мәжбүри туҡтатыу!

source: Force scan of disabled apps and builds.
ba: Һүндерелгән ҡушымталарҙы һәм йыйылмаларҙы мәжбүри сканлау.

source: Found "{path}" graphic without metadata for app "{name}"!
ba: "{name}" ҡушымтаһы өсөн мета-мәғлүмәтһеҙ "{path}" графикаһы табылды!

source: Found bad funding file "{path}" for "{name}":
ba: "{name}" өсөн дөрөҫ булмаған "{path}" финанслау файлы табылды:

source: Found invalid appids in arguments
ba: Аргументтарҙа дөрөҫ булмаған appid-ҙар табылды

source: Found invalid versionCodes for some apps
ba: Ҡайһы бер ҡушымталар өсөн дөрөҫ булмаған versionCode-тар табылды

source: Found multiple JAR Signature Block Files in {path}
ba: {path} эсендә бер нисә JAR имза блок файлы табылды

source: Found multiple Signer Certificates!
ba: Бер нисә имзалаусы сертификаты табылды!

source: Found multiple metadata files for {appid}
ba: {appid} өсөн бер нисә мета-мәғлүмәт файлы табылды

source: Found multiple signing certificates for repository.
ba: Репозиторий өсөн бер нисә имзалау сертификаты табылды.

source: Found no signing certificates for repository.
ba: Репозиторий өсөн имзалау сертификаттары табылманы.

source: Found non-file at %s
ba: %s юлында файл булмаған объект табылды

source: Found {apkfilename} at {url}
ba: {apkfilename} {url} адресында табылды

source: Found {count} problems in {filename}
ba: {filename} эсендә {count} проблема табылды

source: Found {count} warnings in {filename}
ba: {filename} эсендә {count} иҫкәрмә табылды

source: Generated skeleton metadata for {appid}
ba: {appid} өсөн мета-мәғлүмәт ҡалыбы булдырылды

source: Git checkout of '%s' failed
ba: '%s' Git checkout-ы уңышһыҙ булды

source: Git clean failed
ba: Git clean уңышһыҙ булды

source: Git fetch failed
ba: Git fetch уңышһыҙ булды

source: Git remote set-head failed: "%s"
ba: Git remote set-head уңышһыҙ булды: "%s"

source: Git reset failed
ba: Git reset уңышһыҙ булды

source: Git submodule deinit failed
ba: Git submodule deinit уңышһыҙ булды

source: Git submodule sync failed
ba: Git submodule sync уңышһыҙ булды

source: Git submodule update failed
ba: Git submodule update уңышһыҙ булды

source: HTTPS must be used with Subversion URLs!
ba: Subversion URL-дары менән HTTPS ҡулланылырға тейеш!

source: If a git mirror gets to big, allow the archive to be deleted
ba: git көҙгөһө бигерәк ҙурайып китһә, архивты юйырға рөхсәт итеү

source: If this upload fails, try manually uploading to {url}
ba: Был йөкмәү уңышһыҙ булһа, {url} адресына ҡулдан йөкмәп ҡарағыҙ

source: Ignoring '{field}' in '{metapath}' metadata because it is deprecated.
ba: '{metapath}' мета-мәғлүмәттәрендәге '{field}' иҫкергән булғанға иғтибарһыҙ ҡалдырыла.

source: Ignoring FUNDING.yml entry longer than 2048: %s
ba: 2048-ҙән оҙонораҡ FUNDING.yml яҙмаһы иғтибарһыҙ ҡалдырыла: %s

source: Ignoring bad element in manifest: %s
ba: Манифестағы дөрөҫ булмаған элемент иғтибарһыҙ ҡалдырыла: %s

source: Ignoring deprecated {oldfile}, use {newfile}!
ba: Иҫкергән {oldfile} иғтибарһыҙ ҡалдырыла, {newfile} ҡулланығыҙ!

source: Ignoring package without metadata:
ba: Мета-мәғлүмәтһеҙ пакет иғтибарһыҙ ҡалдырыла:

source: Ignoring stale cache data for {apkfilename}
ba: {apkfilename} өсөн иҫкергән кеш мәғлүмәттәре иғтибарһыҙ ҡалдырыла

source: Include APKs that are signed with disabled algorithms like MD5
ba: MD5 кеүек һүндерелгән алгоритмдар менән тамғаланған APK-ларҙы индереү

source: Include the PGP signature .asc files in the mirror
ba: Көҙгөгә PGP-имзалы .asc файлдарын индереү

source: Include the build logs in the mirror
ba: Көҙгөгә йыйыу логтарын индереү

source: Include the source tarballs in the mirror
ba: Көҙгөгә сығанаҡ tarball-дарҙы индереү

source: Including metadata from %s@%s
ba: %s@%s версияһынан мета-мәғлүмәттәр индерелә

source: Including metadata from {path}
ba: {path} юлынан мета-мәғлүмәттәр индерелә

source: Initialising submodules
ba: Аҫмодулдәрҙе инициализациялау

source: Install all signed applications available
ba: Барлыҡ тамғаланған ҡушымталарҙы ҡуйыу

source: Install built packages on devices
ba: Йыйылған пакеттарҙы ҡоролмаларға ҡуйыу

source: Installing %s...
ba: %s ҡуйыла...

source: Installing '{apkfilename}' on {dev}...
ba: '{apkfilename}' {dev} ҡоролмаһына ҡуйыла...

source: Interact with the repo HTTP server
ba: Репоның HTTP-серверы менән эш итеү

source: Invalid APK
ba: Дөрөҫ булмаған APK

source: Invalid AutoUpdateMode: {mode}
ba: Дөрөҫ булмаған AutoUpdateMode: {mode}

source: Invalid UpdateCheckMode: {mode}
ba: Дөрөҫ булмаған UpdateCheckMode: {mode}

source: Invalid VercodeOperation: {field}
ba: Дөрөҫ булмаған VercodeOperation: {field}

source: Invalid VercodeOperation: {invalid_ops}
ba: Дөрөҫ булмаған VercodeOperation: {invalid_ops}

source: Invalid application ID {appid}
ba: Дөрөҫ булмаған ҡушымта идентификаторы {appid}

source: Invalid bulleted list
ba: Дөрөҫ булмаған маркировкалы исемлек

source: Invalid name for published file: %s
ba: Баҫтырылған файл өсөн дөрөҫ булмаған исем: %s

source: Invalid ndk: entry in build: "{ndk}"
ba: Йыйылмала дөрөҫ булмаған ndk: яҙмаһы: "{ndk}"

source: Invalid redirect to non-HTTPS: {before} -> {after}
ba: HTTPS булмаған адресҡа дөрөҫ булмаған йүнәлтеү: {before} -> {after}

source: Invalid scrlib metadata: '{file}' does not exist
ba: Дөрөҫ булмаған scrlib мета-мәғлүмәте: '{file}' юҡ

source: Invalid srclib metadata: could not parse '{file}'
ba: Дөрөҫ булмаған srclib мета-мәғлүмәте: '{file}' танылманы

source: Invalid srclib metadata: unknown key '{key}' in '{file}'
ba: Дөрөҫ булмаған srclib мета-мәғлүмәте: '{file}' эсендә билдәһеҙ '{key}' асҡысы
