Repository: f-droid/fdroidserver
Catalog: locale/ba/LC_MESSAGES/fdroidserver.po
Languages: ba

source: Warn about possible metadata errors
ba: Мөмкин булған мета-мәғлүмәт хаталары тураһында иҫкәртеү

source: WebAssembly binary file
ba: WebAssembly бинар файлы

source: When configured for signed indexes, create only unsigned indexes at this stage
ba: Тамғаланған индекстар өсөн көйләнгәндә, был этапта тик тамғаланмаған индекстарҙы ғына булдырыу

source: When linting the entire repository yamllint is disabled by default. This option forces yamllint regardless.
ba: Бөтә репозиторийҙы линтлағанда yamllint стандарт буйынса һүндерелгән. Был опция yamllint-ты мәжбүри рәүештә эшләтә.

source: When signing or verifying fails, exit with an error code.
ba: Тамғалау йәки тикшереү уңышһыҙ булһа, хата коды менән сығыу.

source: Would you like to download and install F-Droid.apk via adb? (YES/no)
ba: F-Droid.apk-ны adb аша йөкләп ҡуйырға теләйһегеҙме? (ЭЙЕ/юҡ)

source: Would you like to download the app(s) from f-droid.org? (YES/no)
ba: Ҡушымта(лар)ҙы f-droid.org-тан йөкләргә теләйһегеҙме? (ЭЙЕ/юҡ)

source: X.509 'Distinguished Name' used when generating keys
ba: Асҡыстарҙы булдырғанда ҡулланылған X.509 'Айырым исем' (Distinguished Name)

source: You can use ANDROID_HOME to set the path to your SDK, i.e.:
ba: SDK-ға юлды күрһәтеү өсөн ANDROID_HOME ҡуллана алаһығыҙ, йәғни:

source: ZIP file archive
ba: ZIP файл архивы

source: adb reports {serial} is "{status}"!
ba: adb хәбәр итә: {serial} — "{status}"!

source: adding IdentityFile to {path}
ba: IdentityFile {path} юлына өҫтәлә

source: adding to {name}: {path}
ba: {name}-ға өҫтәлә: {path}

source: ambiguous option: %(option)s could match %(matches)s
ba: ике мәғәнәле опция: %(option)s %(matches)s-ҡа тап килеүе мөмкин

source: apksigner in build-tools;{version} passes APKs with invalid v3 signatures, ignoring.
ba: build-tools;{version} эсендәге apksigner дөрөҫ булмаған v3 имзалы APK-ларҙы үткәрә, иғтибарһыҙ ҡалдырыла.

source: apksigner not found! Cannot sign or verify modern APKs
ba: apksigner табылманы! Заманса APK-ларҙы тамғалап йәки тикшереп булмай

source: apksigner not found, it's required for signing!
ba: apksigner табылманы, ул тамғалау өсөн кәрәк!

source: application ID of file to operate on
ba: эшкәртеләсәк файлдың ҡушымта идентификаторы

source: application ID with optional versionCode in the form APPID[:VERCODE]
ba: ҡушымта идентификаторы, APPID[:VERCODE] рәүешендә versionCode өҫтәмә булыуы мөмкин

source: archive_url needs to end with /archive
ba: archive_url /archive менән тамамланырға тейеш

source: argument "-" with mode %r
ba: %r режимлы "-" аргументы

source: argument %(argument_name)s: %(message)s
ba: %(argument_name)s аргументы: %(message)s

source: attempting bare SSH connection to test deploy key:
ba: урынлаштырыу асҡысын һынау өсөн ябай SSH тоташыуы яһала:

source: can not parse scrlib spec (not a string): '{}'
ba: scrlib спецификацияһын танып булмай (юл түгел): '{}'

source: can't open '%(filename)s': %(error)s
ba: '%(filename)s' асылманы: %(error)s

source: can't open non-https url: '{};
ba: https булмаған url-ды асып булмай: '{};

source: cannot find required srclibs: "{path}"
ba: кәрәкле srclib-тар табылманы: "{path}"

source: cannot have multiple subparser arguments
ba: бер нисә аҫпарсер аргументы була алмай

source: cannot merge actions - two groups are named %r
ba: ғәмәлдәрҙе берләштереп булмай — ике төркөм %r тип аталған

source: cannot publish update, did you set the deploy key?
ba: яңыртыуҙы баҫтырып булмай, урынлаштырыу асҡысын күрһәттегеҙме?

source: cloning {url}
ba: {url} клонлана

source: commands from plugin modules:
ba: плагин модулдәренән командалар:

source: conflicting option string: %s
ba: ҡапма-ҡаршылыҡлы опция юлы: %s

source: conflicting subparser alias: %s
ba: ҡапма-ҡаршылыҡлы аҫпарсер псевдонимы: %s

source: conflicting subparser: %s
ba: ҡапма-ҡаршылыҡлы аҫпарсер: %s

source: could not parse '{path}'
ba: '{path}' танылманы

source: could not parse srclib spec (no name specified): '{}'
ba: srclib спецификацияһын танып булманы (исем күрһәтелмәгән): '{}'

source: could not parse srclib spec (no ref specified): '{}'
ba: srclib спецификацияһын танып булманы (ref күрһәтелмәгән): '{}'

source: created {path}
ba: {path} булдырылды

source: current version is newer: old vercode={old}, new vercode={new}
ba: ағымдағы версия яңыраҡ: иҫке vercode={old}, яңы vercode={new}

source: deleting: repo/{apkfilename}
ba: юйыла: repo/{apkfilename}

source: dependency file without lock
ba: йоҙаҡһыҙ бәйлелек файлы

source: deployed process log {path} to {dest}
ba: эшкәртеү логы {path} {dest} адресына урынлаштырылды

source: dest= is required for options like %r
ba: %r кеүек опциялар өсөн dest= кәрәк

source: downloading '{}'
ba: '{}' йөкләнә

source: downloading scanner signatures from '{}' failed
ba: сканлаусы имзаларын '{}' адресынан йөкләү уңышһыҙ булды

source: executable binary, possibly code
ba: башҡарылыусы бинар, код булыуы мөмкин

source: expected %s argument
ba: %s аргумент көтөлә

source: expected at least one argument
ba: кәмендә бер аргумент көтөлә

source: expected at most one argument
ba: күп тигәндә бер аргумент көтөлә

source: expected one argument
ba: бер аргумент көтөлә

source: fdroid [<command>] [-h|--help|--version|<args>]
ba: fdroid [<команда>] [-h|--help|--version|<аргументтар>]

source: fetch the latest version of signatures from the web
ba: имзаларҙың һуңғы версияһын вебтән алыу

source: force metadata errors (default) to be warnings, or to be ignored.
ba: мета-мәғлүмәт хаталарын (стандарт) иҫкәрмәләргә әйләндерергә йәки иғтибарһыҙ ҡалдырырға мәжбүр итеү.

source: git svn clone failed
ba: git svn clone уңышһыҙ булды

source: gzip file archive
ba: gzip файл архивы

source: ignored explicit argument %r
ba: асыҡтан-асыҡ %r аргументы иғтибарһыҙ ҡалдырылды

source: index-v1 must have a signature, use `fdroid signindex` to create it!
ba: index-v1 имзалы булырға тейеш, уны булдырыу өсөн `fdroid signindex` ҡулланығыҙ!

source: index-v2 must have a signature, use `fdroid signindex` to create it!
ba: index-v2 имзалы булырға тейеш, уны булдырыу өсөн `fdroid signindex` ҡулланығыҙ!

source: invalid %(type)s value: %(value)r
ba: дөрөҫ булмаған %(type)s ҡиммәте: %(value)r

source: invalid choice: %(value)r (choose from %(choices)s)
ba: дөрөҫ булмаған һайлау: %(value)r (%(choices)s араһынан һайлағыҙ)

source: invalid conflict_resolution value: %r
ba: дөрөҫ булмаған conflict_resolution ҡиммәте: %r

source: invalid option string %(option)r: must start with a character %(prefix_chars)r
ba: дөрөҫ булмаған %(option)r опция юлы: %(prefix_chars)r символы менән башланырға тейеш

source: ipfs_cid not found, skipping CIDv1 generation
ba: ipfs_cid табылманы, CIDv1 булдырыу үткәреп ебәрелә

source: latest build recipe is newer: old vercode={old}, new vercode={new}
ba: һуңғы йыйыу рецебы яңыраҡ: иҫке vercode={old}, яңы vercode={new}

source: local_copy_dir does not end with "fdroid", perhaps you meant: "{path}"
ba: local_copy_dir "fdroid" менән тамамланмай, бәлки һеҙ быны күҙ уңында тоттоғоҙ: "{path}"

source: local_copy_dir must be an absolute path!
ba: local_copy_dir абсолют юл булырға тейеш!

source: local_copy_dir must be directory, not a file!
ba: local_copy_dir каталог булырға тейеш, файл түгел!

source: mirror '%s' does not end with 'fdroid'!
ba: '%s' көҙгөһө 'fdroid' менән тамамланмай!

source: mirrors set twice, in config.yml and {path}!
ba: көҙгөләр ике тапҡыр күрһәтелгән, config.yml-да һәм {path}-та!

source: mutually exclusive arguments must be optional
ba: бер-береһен инҡар итеүсе аргументтар өҫтәмә булырға тейеш

source: next {name} cache update due in {time}
ba: киләһе {name} кешын яңыртыу {time} аша

source: no "icon" in {appid}
ba: {appid}-та "icon" юҡ

source: no APK supplied
ba: APK бирелмәгән

source: no version information found
ba: версия тураһында мәғлүмәт табылманы

source: not allowed with argument %s
ba: %s аргументы менән рөхсәт ителмәй

source: one of the arguments %s is required
ba: %s аргументтарының береһе кәрәк

source: only accepts strings, lists, and tuples
ba: тик юлдарҙы, исемлектәрҙе һәм кортеждарҙы ғына ҡабул итә

source: options
ba: опциялар

source: overwriting existing {path}
ba: инде булған {path} өҫтөнән яҙыла

source: positional arguments
ba: позицион аргументтар

source: process log deploy {path} to {dest} failed!
ba: эшкәртеү логын {path} {dest} адресына урынлаштырыу уңышһыҙ булды!

source: reference binary missing signature
ba: өлгө бинарҙың имзаһы юҡ

source: refuse downloading via insecure HTTP connection (use HTTPS or specify --no-check-https): {apkfilename}
ba: хәүефһеҙ булмаған HTTP тоташыуы аша йөкләүҙән баш тартыу (HTTPS ҡулланығыҙ йәки --no-check-https күрһәтегеҙ): {apkfilename}

source: repo_icon "repo/icons/%s" does not exist, generating placeholder.
ba: "repo/icons/%s" repo_icon-ы юҡ, ҡалып булдырыла.

source: repo_url needs to end with /repo
ba: repo_url /repo менән тамамланырға тейеш

source: rsync is missing or broken: {error}
ba: rsync юҡ йәки боҙолған: {error}

source: s3cmd sync indexes {path} to {url} and delete
ba: s3cmd индекстарҙы {path}-тан {url}-ға синхронлаштыра һәм юя

source: s3cmd syncs indexes from {path} to {url} and deletes removed
ba: s3cmd индекстарҙы {path}-тан {url}-ға синхронлаштыра һәм юйылғандарҙы юя

source: scanner cache is malformed! You can clear it with: '{clear}'
ba: сканлаусы кешы боҙолған! Уны былай таҙартырға мөмкин: '{clear}'

source: serverwebroot: path does not end with "fdroid", perhaps you meant one of these:
ba: serverwebroot: юл "fdroid" менән тамамланмай, бәлки һеҙ быларҙың береһен күҙ уңында тоттоғоҙ:

source: shared library
ba: уртаҡ китапхана

source: show this help message and exit
ba: был ярҙам хәбәрен күрһәтеү һәм сығыу

source: signed APK, either a file-path or HTTPS URL.
ba: тамғаланған APK, файл юлы йәки HTTPS URL-ы.

source: skip deploying full build logs: log content is empty
ba: тулы йыйыу логтарын урынлаштырыуҙы үткәреп ебәреү: лог эстәлеге буш

source: skip deploying full build logs: not enabled in config
ba: тулы йыйыу логтарын урынлаштырыуҙы үткәреп ебәреү: конфигурацияла ҡабыҙылмаған

source: skipping source tarball: {path}
ba: сығанаҡ tarball үткәреп ебәрелә: {path}

source: srclibs missing name and/or @
ba: srclibs-та исем һәм/йәки @ юҡ

source: static library
ba: статик китапхана

source: supplied reference binary has allowed signer {signer}
ba: бирелгән өлгө бинарҙың рөхсәт ителгән имзалаусыһы {signer} бар

source: the following arguments are required: %s
ba: түбәндәге аргументтар мотлаҡ: %s

source: true
ba: дөрөҫ

source: unexpected option string: %s
ba: көтөлмәгән опция юлы: %s

source: unknown parser %(parser_name)r (choices: %(choices)s)
ba: билдәһеҙ парсер %(parser_name)r (һайлау варианттары: %(choices)s)

source: unrecognized arguments: %s
ba: танылмаған аргументтар: %s

source: unsafe permissions on '{config_file}' (should be 0600)!
ba: '{config_file}' өсөн хәүефле рөхсәттәр (0600 булырға тейеш)!

source: usage:
ba: ҡулланыу:

source: using Apache libcloud to sync with {url}
ba: {url} менән синхронлаштырыу өсөн Apache libcloud ҡулланыла

source: virustotal.com is rate limiting, waiting to retry...
ba: virustotal.com сикләү ҡуйҙы, ҡабатлап ҡарау өсөн көтөлә...

source: yes
ba: эйе

source: {0} app, {1} key aliases
ba: {0} ҡушымта, {1} асҡыс псевдонимы

source: {apkfilename} ({appid}) has no metadata!
ba: {apkfilename} ({appid}) өсөн мета-мәғлүмәт юҡ!

source: {apkfilename}'s AndroidManifest.xml has a bad date:
ba: {apkfilename}-ның AndroidManifest.xml-ында дөрөҫ булмаған дата:

source: {appid} does not have a name! Using application ID instead.
ba: {appid} өсөн исем юҡ! Уның урынына ҡушымта идентификаторы ҡулланыла.

source: {appid} from {path} is not a valid Android application ID!
ba: {path} эсендәге {appid} — дөрөҫ Android ҡушымта идентификаторы түгел!

source: {appid} from {path} is not a valid Java Package Name!
ba: {path} эсендәге {appid} — дөрөҫ Java пакет исеме түгел!

source: {appid} has both APKs and files: {files}
ba: {appid}-та APK-лар ҙа, файлдар ҙа бар: {files}

source: {appid} is missing {name}
ba: {appid}-та {name} юҡ

source: {appid}: Unknown extlib {path} in build '{versionName}'
ba: {appid}: '{versionName}' йыйылмаһында билдәһеҙ extlib {path}

source: {appid}: no builds specified, running on current source state
ba: {appid}: йыйылмалар күрһәтелмәгән, ағымдағы сығанаҡ хәлендә эшләтелә

source: {appid}: {field} must be a '{type}', but it is a '{fieldtype}!'
ba: {appid}: {field} '{type}' булырға тейеш, ләкин ул '{fieldtype}'!

source: {appid}: {field} must be a '{type}', but it is a '{fieldtype}'!
ba: {appid}: {field} '{type}' булырға тейеш, ләкин ул '{fieldtype}'!

source: {build_flag} must be an integer, found: {value}
ba: {build_flag} бөтөн һан булырға тейеш, табылды: {value}

source: {build_flag} must be list or string, found: {value}
ba: {build_flag} исемлек йәки юл булырға тейеш, табылды: {value}

source: {file} is blank or corrupt!
ba: {file} буш йәки боҙолған!

source: {name} "{section}/icons/{path}" does not exist! Check "config.yml".
ba: {name} "{section}/icons/{path}" юҡ! "config.yml"-ды тикшерегеҙ.

source: {path1} is a duplicate of {path2}, remove one!
ba: {path1} — {path2}-нең күсермәһе, береһен юйығыҙ!

source: {path} already exists, ignoring import results!
ba: {path} инде бар, импорт һөҙөмтәләре иғтибарһыҙ ҡалдырыла!

source: {path} does not exist! Create it by running:
ba: {path} юҡ! Уны булдырыу өсөн эшләтегеҙ:

source: {path} has bad file signature "{pattern}", possible Janus exploit!
ba: {path} файлының имзаһы дөрөҫ түгел "{pattern}", Janus эксплойты булыуы мөмкин!

source: {path} has been flagged by virustotal {count} times:
ba: {path} virustotal тарафынан {count} тапҡыр билдәләнгән:

source: {path} has the wrong fingerprint ({fingerprint})!
ba: {path} файлының бармаҡ эҙе дөрөҫ түгел ({fingerprint})!

source: {path} is not "key: value" dict, but a {datatype}!
ba: {path} — "key: value" һүҙлеге түгел, ә {datatype}!

source: {path} is not a standard config file!
ba: {path} — стандарт конфигурация файлы түгел!

source: {path} is not list, but a {datatype}!
ba: {path} — исемлек түгел, ә {datatype}!

source: {path} is not {expected_type}, but a {datatype}!
ba: {path} — {expected_type} түгел, ә {datatype}!

source: {path} is zero size!
ba: {path} үлсәме нуль!

source: {path} more than 200MB, manually upload: {url}
ba: {path} 200MB-тан ҙурыраҡ, ҡулдан йөкләү: {url}

source: {path}: "{code}" is not a valid ISO_3166-1 alpha-2 country code!
ba: {path}: "{code}" — дөрөҫ ISO_3166-1 alpha-2 ил коды түгел!

source: {url} does not end with "fdroid", check the URL path!
ba: {url} "fdroid" менән тамамланмай, URL юлын тикшерегеҙ!

source: {url} does not start with "http"!
ba: {url} "http" менән башланмай!

source: {} build failed
ba: {} йыйыу уңышһыҙ булды

source: {} build succeeded
ba: {} йыйыу уңышлы булды
